## Advanced Business Analysis â€“ Customer, Time & Delivery Insights

This notebook focuses on **moderate-level business analysis questions** that explore
**customer behavior**, **time-based trends**, and **delivery operations** in a
Swiggy-like food delivery platform.

The objective of this analysis is to move beyond basic revenue metrics and
understand **how users behave**, **when orders are placed**, and **how operational
performance impacts customer experience**.

All analysis in this notebook is performed using **SQL SELECT queries only**, based on
the validated dataset from previous stages.

## Outcome of This Notebook

By answering the above questions, this notebook aims to:

- Identify high-value and loyal customers
- Understand time-based demand fluctuations
- Measure operational efficiency and delivery performance
- Connect delivery experience with customer satisfaction

The insights derived here can directly inform **marketing strategy**, **operations planning**, and **platform optimization decisions**.

In [1]:
%load_ext sql

In [2]:
%sql mysql+mysqlconnector://root:root@localhost

In [3]:
%%sql
use swiggy_da;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [4]:
%%sql
# Number of repeat customers (users with more than one order)
SELECT 
    COUNT(*) AS repeat_customers
FROM (
    SELECT user_id
    FROM orders
    GROUP BY user_id
    HAVING COUNT(order_id) > 1
) AS repeat_users;

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[(500,)]

In [5]:
%%sql
-- Percentage of one-time vs repeat customers
select customer_type,
    ROUND(COUNT(*) * 100.0 / SUM(COUNT(*)) OVER (), 2) AS user_percentage
from (
    select user_id, case
            WHEN COUNT(order_id) = 1 THEN 'One-Time'
            ELSE 'Repeat'
        END AS customer_type
    FROM orders
    GROUP BY user_id
) AS user_orders
GROUP BY customer_type;

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[('Repeat', Decimal('100.00'))]

In [6]:
%%sql
# Users with the highest number of orders
select user_id,  COUNT(order_id) AS total_orders
from orders
GROUP BY user_id
ORDER BY total_orders DESC
LIMIT 10;

 * mysql+mysqlconnector://root:***@localhost
10 rows affected.

[(1, 21),
 (190, 21),
 (467, 20),
 (497, 18),
 (348, 18),
 (376, 18),
 (21, 17),
 (27, 17),
 (57, 17),
 (171, 17)]

In [7]:
%%sql
# Compare average order value between one-time and repeat customers

select  customer_type,  ROUND(AVG(total_amount), 2) AS average_order_value
   
   
from (
    # First, classify users based on how many orders they placed
    SELECT
        o.user_id,
        o.total_amount,
        CASE
            WHEN COUNT(*) OVER (PARTITION BY o.user_id) = 1 
                THEN 'One-Time'
            ELSE 'Repeat'
        END AS customer_type
    from orders o
    WHERE o.order_status = 'DELIVERED'
) classified_orders
GROUP BY customer_type;

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[('Repeat', Decimal('1041.92'))]

In [8]:
%%sql
# peak ordering hours based on number of orders placed

select
    hour(order_time) as order_hour,
    count(order_id) as total_orders
from orders
where order_status = 'DELIVERED'
group by order_hour
order by total_orders desc
limit 10;

 * mysql+mysqlconnector://root:***@localhost
10 rows affected.

[(23, 198),
 (5, 187),
 (0, 184),
 (20, 184),
 (13, 178),
 (1, 178),
 (8, 178),
 (11, 176),
 (6, 174),
 (21, 172)]

In [9]:
%%sql
# Orders by day of the week

select
    dayname(order_time) as day_of_week,
    count(order_id) as total_orders
from orders
where order_status = 'DELIVERED'
group by day_of_week
order by total_orders desc;

 * mysql+mysqlconnector://root:***@localhost
7 rows affected.

[('Tuesday', 613),
 ('Monday', 591),
 ('Thursday', 586),
 ('Wednesday', 584),
 ('Saturday', 580),
 ('Sunday', 568),
 ('Friday', 543)]

In [10]:
%%sql
#daily revenue trend over time

select
    date(order_time) as order_date,
    round(sum(total_amount), 2) as daily_revenue
from orders
where order_status = 'DELIVERED'
group by order_date
order by order_date
limit 10;

 * mysql+mysqlconnector://root:***@localhost
10 rows affected.

[(datetime.date(2025, 7, 20), Decimal('10985')),
 (datetime.date(2025, 7, 21), Decimal('29923')),
 (datetime.date(2025, 7, 22), Decimal('24621')),
 (datetime.date(2025, 7, 23), Decimal('33093')),
 (datetime.date(2025, 7, 24), Decimal('27416')),
 (datetime.date(2025, 7, 25), Decimal('18590')),
 (datetime.date(2025, 7, 26), Decimal('15832')),
 (datetime.date(2025, 7, 27), Decimal('39245')),
 (datetime.date(2025, 7, 28), Decimal('22685')),
 (datetime.date(2025, 7, 29), Decimal('32750'))]

In [11]:
%%sql
# Compare order volume between weekdays and weekends

select
    case
        when dayofweek(order_time) in (1, 7)
            then 'weekend'
        else 'weekday'
    end as day_type,
    count(order_id) as total_orders
from orders
where order_status = 'DELIVERED'
group by day_type;

 * mysql+mysqlconnector://root:***@localhost
2 rows affected.

[('weekday', 2917), ('weekend', 1148)]

In [12]:
%%sql
# Average delivery time during peak vs non-peak hours

select
    case
        when hour(o.order_time) between 12 and 14
          or hour(o.order_time) between 19 and 21
            then 'peak'
        else 'non-peak'
    end as time_period,
    round(avg(d.actual_minutes), 2) as avg_delivery_time_minutes
from orders o
join deliveries d
    on o.order_id = d.order_id
where o.order_status = 'DELIVERED'
group by time_period;

 * mysql+mysqlconnector://root:***@localhost
2 rows affected.

[('non-peak', Decimal('39.83')), ('peak', Decimal('39.92'))]

In [13]:
%%sql
# What percentage of deliveries are delayed?
select
    round(
        sum(case when actual_minutes > expected_minutes then 1 else 0 end)
        * 100.0 / count(*),
        2
    ) as delayed_delivery_percentage
from deliveries
where delivery_status = 'DELIVERED';

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[(Decimal('48.33'),)]

In [14]:
%%sql
# Which restaurants have the highest average delivery time?
select
    r.name as restaurant_name,
    round(avg(d.actual_minutes), 2) as avg_delivery_time_minutes
from deliveries d
join orders o
    on d.order_id = o.order_id
join restaurants r
    on o.restaurant_id = r.restaurant_id
where d.delivery_status = 'DELIVERED'
group by r.name
order by avg_delivery_time_minutes desc;

 * mysql+mysqlconnector://root:***@localhost
7 rows affected.

[('Salad Days', Decimal('40.52')),
 ('Dhaba 1986', Decimal('40.19')),
 ('Wok & Roll', Decimal('39.97')),
 ('Sweet Truth', Decimal('39.92')),
 ('Spicy Hub', Decimal('39.83')),
 ('Royal Biryani House', Decimal('39.19')),
 ('The Pizza Box', Decimal('39.10'))]

In [15]:
%%sql
#Does a longer delivery time lead to lower ratings?
select
    case
        when d.actual_minutes <= d.expected_minutes then 'on_time'
        else 'delayed'
    end as delivery_type,
    round(avg(r.rating), 2) as avg_rating
from deliveries d
join reviews r
    on d.order_id = r.order_id
group by delivery_type;

 * mysql+mysqlconnector://root:***@localhost
2 rows affected.

[('delayed', Decimal('3.58')), ('on_time', Decimal('3.51'))]

In [16]:
%%sql
# What is the average delivery time by city/location?
select
    u.location_area,
    round(avg(d.actual_minutes), 2) as avg_delivery_time_minutes
from deliveries d
join orders o
    on d.order_id = o.order_id
join users u
    on o.user_id = u.user_id
where d.delivery_status = 'DELIVERED'
group by u.location_area
order by avg_delivery_time_minutes desc;

 * mysql+mysqlconnector://root:***@localhost
10 rows affected.

[('East Delhi', Decimal('40.52')),
 ('Central Delhi', Decimal('40.30')),
 ('West Delhi', Decimal('40.05')),
 ('North Delhi', Decimal('40.04')),
 ('Hyderabad', Decimal('39.86')),
 ('Chennai', Decimal('39.76')),
 ('Pune', Decimal('39.57')),
 ('South Delhi', Decimal('39.55')),
 ('Bangalore', Decimal('39.25')),
 ('Mumbai', Decimal('39.18'))]

In [17]:
%%sql
# Are certain locations more prone to delivery delays?
select
    u.location_area,
    round(
        sum(case when d.actual_minutes > d.expected_minutes then 1 else 0 end)
        * 100.0 / count(*),
        2
    ) as delay_percentage
from deliveries d
join orders o
    on d.order_id = o.order_id
join users u
    on o.user_id = u.user_id
group by u.location_area
order by delay_percentage desc;

 * mysql+mysqlconnector://root:***@localhost
10 rows affected.

[('East Delhi', Decimal('51.08')),
 ('Central Delhi', Decimal('50.71')),
 ('North Delhi', Decimal('50.44')),
 ('West Delhi', Decimal('49.01')),
 ('Chennai', Decimal('48.43')),
 ('Pune', Decimal('48.36')),
 ('Hyderabad', Decimal('47.23')),
 ('Mumbai', Decimal('46.97')),
 ('South Delhi', Decimal('46.49')),
 ('Bangalore', Decimal('44.76'))]